/***************************************************************************************
*        File Name              :	GPRS_H
*        CopyRight              :	gaunthan
*        ModuleName             :	GPRS
*
*        CPU                    :   MSP430
*        RTOS                   :   None
*
*        Create Data            :	2016/5/15
*        Author/Corportation    :	gaunthan
*
*        Abstract Description   :	封装SIM900A_mini GPS模块，提供发送邮件功能。
*
*--------------------------------Revision History--------------------------------------
*       No      version     Date        Revised By      Item        Description
*       1       v1.0        2016/5/15	gaunthan        		 	Create this file
***************************************************************************************/

/**************************************************************
*        Multi-Include-Prevent Section
**************************************************************/
#ifndef GPRS_H
#define GPRS_H

/**************************************************************
*        Debug switch Section
**************************************************************/
/**
 * GPRS模块调试开关宏。1代表开启调试信息，0代表不开启。
 */
#define GPRS_DEBUG_ON 1


/**************************************************************
*        Include File Section
**************************************************************/
#include "HAL_AppUart.h"
#include "general.h"
#include <stdlib.h>
#include <string.h>

/**************************************************************
*        Macro Define Section
**************************************************************/


/**************************************************************
*        Struct Define Section
**************************************************************/




/**************************************************************
*        Prototype Declare Section
**************************************************************/


/**
 * @brief	初始化GPS模块与相关引脚。
 * @param	None
 * @return	None
 */
void GPRS_Init(void);


/**
 * @brief	建立GPRS TCP环境
 * @param	None
 * @return	OK 初始化成功
 * 			ERROR 初始化失败
 */
Status GPRS_InitTCPEnv(void);




/**************************************************************
*        End-Multi-Include-Prevent Section
**************************************************************/
#endif
