
/**************************************************************
*	Multi-Include-Prevent Section
**************************************************************/
#ifndef SCALE_H
#define SCALE_H


/**************************************************************
*	Debug switch Section
**************************************************************/



/**************************************************************
*	Include File Section
**************************************************************/

# include <stdio.h>
# include "Caculate.h"
#include "HX711.h"
#include "HAL_AppUart.h"
/**************************************************************
*	Macro Define Section
**************************************************************/
# define uchar unsigned char
# define uint unsigned int
# define ulong unsigned long

/**************************************************************
*	Struct Define Section
**************************************************************/



/**************************************************************
*	Prototype Declare Section
**************************************************************/
static float transform_to_digital();


/**
 *  @name			void GetWeight();
 *	@description 	实现电子秤功能的函数
 *	@param			weightBuff 存放重量信息的缓冲区
 *	@return			无
 *  @notice			需要用到LCD1602，所以必须先初始化。在此函数内会依次调用其他模块的函数实现功能
 */
void GetWeight(char* weightBuff);


/**************************************************************
*	End-Multi-Include-Prevent Section
**************************************************************/
#endif /* SCALE_H_ */
