/***************************************************************************************
*        File Name              :	lock.h
*        CopyRight              :	gaunthan
*        ModuleName             :	lock
*
*        CPU                    :   MSP430
*        RTOS                   :   None
*
*        Create Data            :	2016/5/27
*        Author/Corportation    :	gaunthan
*
*        Abstract Description   :	提供电子锁模块的初始化、开锁封装。
*
*--------------------------------Revision History--------------------------------------
*       No      version     Date        Revised By      Item        Description
*       1       v1.0        2016/5/27	gaunthan        		 	Create this file
*
***************************************************************************************/

/**************************************************************
*        Multi-Include-Prevent Section
**************************************************************/
#ifndef LOCK_H
#define LOCK_H

/**************************************************************
*        Debug switch Section
**************************************************************/
/**
 * 模块调试开关宏。1代表开启调试信息，0代表不开启。
 */
#define LOCK_DEBUG_ON 0


/**************************************************************
*        Include File Section
**************************************************************/
#include "general.h"
#include "msp430f5529.h"

/**************************************************************
*        Macro Define Section
**************************************************************/
/**
 * @brief	电子锁控制引脚定义
 */
#define LOCK_PIN BIT0


/**
 * @brief	控制引脚输出低电平
 */
#define LOCK_PIN_LOW() 							\
	do {										\
		P4OUT &= ~LOCK_PIN;						\
	}while(0)


/**
 * @brief	控制引脚输出高电平
 */
#define LOCK_PIN_HIGH() 						\
	do {										\
		P4OUT |= LOCK_PIN;						\
	}while(0)


/**************************************************************
*        Struct Define Section
**************************************************************/



/**************************************************************
*        Prototype Declare Section
**************************************************************/

/**
 * @brief	初始化电子锁硬件连接
 * @param	None
 * @return	None
 */
void LOCK_InitPort(void);


/**
 * @brief	解锁电子锁
 * @param	None
 * @return	None
 */
void LOCK_Unlock(void);



/**************************************************************
*        End-Multi-Include-Prevent Section
**************************************************************/
#endif
